lfazio/rv32cortex-m/src/platform/stm32f746/main.c
/* ------------------------------------------------------------------ */
/* ECALL services                                                      */
/* ------------------------------------------------------------------ */

/*
 * The same newlib-style calls the host runner implements, so a guest built
 * once behaves identically in both places. Anything else falls through to
 * the architectural trap, leaving guests with their own handler unaffected.
 *
 *   nr = 64  write(fd, buf, len)
 *   nr = 93  exit(code)
 *
 * The frontend has already unpacked its own calling convention into
 * emu_syscall_t, so nothing here knows which registers those arrived in.
 */
static uint32_t g_exit_code;
static bool     g_exited;

static bool guest_syscall(emu_cpu_t *cpu, emu_syscall_t *sc, void *user)
{
    (void)user;

    switch (sc->nr) {
    case 64: {
        const uint32_t buf = sc->arg[1];
        const uint32_t len = sc->arg[2];
        for (uint32_t i = 0; i < len; i++) {
            uint32_t byte;
            if (emu_bus_read(&g_bus, buf + i, 1u, &byte) != EMU_FAULT_NONE) {
                break;
            }
            guest_uart_tx(NULL, (uint8_t)byte);
        }
        sc->ret = len;
        return true;
    }

    case 93:
        g_exit_code = sc->arg[0];
        g_exited = true;
        g_core.ops->halt(cpu);
        return true;

    default:
        return false;
    }
}

/* ------------------------------------------------------------------ */
/* Cache maintenance                                                   */
/* ------------------------------------------------------------------ */

/*
 * Zicbom mapped onto ARMv7-M cache maintenance.
 *
 * The Cortex-M7 in the STM32F746 has both caches, so unlike on the F446 --
 * where every one of these was a no-op the spec explicitly permits -- these
 * are real operations on the lines backing the guest's block. A guest that
 * hands a buffer to DMA and skips the cbo is now wrong in a way it was not
 * on the M4, which is the honest consequence of the part having a cache
 * rather than something the emulator should paper over.
 */
static void arm_cache_maint(void *ctx, void *host, uint32_t len,
                            emu_cache_op_t op)
{
    (void)ctx;

#if defined(__DCACHE_PRESENT) && (__DCACHE_PRESENT == 1U)
    switch (op) {
    case EMU_CACHE_CLEAN:
        SCB_CleanDCache_by_Addr((uint32_t *)host, (int32_t)len);
        break;
    case EMU_CACHE_INVAL:
        SCB_InvalidateDCache_by_Addr((uint32_t *)host, (int32_t)len);
        break;
    case EMU_CACHE_FLUSH:
        SCB_CleanInvalidateDCache_by_Addr((uint32_t *)host, (int32_t)len);
        break;
    }
#else
    (void)host;
    (void)len;
    (void)op;
    /* No data cache on this part: nothing to maintain. */
#endif
}

static const emu_cache_ops_t g_cache_ops = {
    .maint = arm_cache_maint,
    .ctx = NULL,
};

/* ------------------------------------------------------------------ */
/* Guest address space                                                 */
/* ------------------------------------------------------------------ */

/*
 * Peripheral passthrough policy.
 *
 * Guest 0x40000000..0x5FFFFFFF maps one-to-one onto the STM32's own
 * peripheral space, so a guest driver uses exactly the addresses printed
 * in RM0385 with no translation to reason about. This is what keeps
 * peripheral drivers in the guest and the ARM-side port thin: moving to
 * another STM32 means changing the clock setup and this table, not writing
 * new drivers.
 *
 * Only what would take the emulator down with the guest is withheld:
 *
 *   PWR           dropping over-drive at 180 MHz stalls the core
 *   RCC CR/PLL    reconfiguring the PLL kills the clock the emulator runs on
 *   FLASH         the flash controller can erase this firmware underneath us
 *
 * Note what is deliberately *not* withheld: the rest of RCC, including
 * AHB1ENR/APB1ENR/APB2ENR and the peripheral reset registers. A guest
 * driver has to be able to ungate its own peripheral's clock, and denying
 * that would push every driver back into the firmware.
 *
 * This table is the same as the F446's, and that is a checked result
 * rather than an assumption: all three withheld blocks sit at identical
 * addresses in RM0385 and RM0390 -- PWR at 0x40007000, RCC at 0x40023800,
 * the flash interface at 0x40023C00. What this part adds (LPTIM1, SPDIFRX,
 * I2C4, CAN2, HDMI-CEC, UART7/8, SAI2, LCD-TFT, Ethernet, CRYP/HASH/RNG)
 * all falls inside spans that were already read-write, and none of it can
 * take the emulator down with the guest.
 *
 * The console moved to USART3 for this board, and USART3 at 0x40004800 is
 * inside the guest's read-write span -- exactly as USART2 was on the F446.
 * A guest that reprograms it silences the console, which is the same
 * bargain as everywhere else here: the guest owns the peripherals.
 */
static const struct {
    const char *name;
    uint32_t    base;
    uint32_t    size;
    uint8_t     perm;
} g_periph_map[] = {
    /* APB1 up to PWR: timers, RTC, WWDG, SPI2/3, USART2/3, UART4/5, I2C */
    { "apb1",       0x40000000u, 0x00007000u, EMU_PERM_RW },
    { "pwr",        0x40007000u, 0x00000400u, EMU_PERM_R  },
    /* Rest of APB1, all of APB2, GPIO and CRC */
    { "apb1b+apb2", 0x40007400u, 0x0001C400u, EMU_PERM_RW },
    /* RCC clock tree: CR, PLLCFGR, CFGR, CIR */
    { "rcc-clock",  0x40023800u, 0x00000010u, EMU_PERM_R  },
    /* RCC resets and peripheral clock enables: the guest's to drive */
    { "rcc-periph", 0x40023810u, 0x000003F0u, EMU_PERM_RW },
    /* Flash interface: ACR, keys, control, option bytes */
    { "flash-ctl",  0x40023C00u, 0x00000400u, EMU_PERM_R  },
    /* BKPSRAM, DMA1/2, USB OTG HS, and AHB2 up to 0x5FFFFFFF */
    { "ahb1b+ahb2", 0x40024000u, 0x1FFDC000u, EMU_PERM_RW },
};

/* ------------------------------------------------------------------ */
/* Real interrupt lines                                                */
/* ------------------------------------------------------------------ */

