lfazio/rv32cortex-m/src/platform/stm32f746/main.c
/*
 * Bridging the NVIC to the APLIC.
 *
 * An interrupt is the one thing the passthrough window cannot carry. A
 * guest driver reaches a peripheral by using its address, but when that
 * peripheral raises an interrupt the NVIC vectors here, into the emulator,
 * with the guest nowhere in sight.
 *
 * The handshake is forced by one fact: nothing on this side can service the
 * device. Only the guest's driver knows how, and it will not run until the
 * emulator returns from the ISR. A level-triggered peripheral therefore
 * re-asserts the moment the handler exits, and the emulator would spin in
 * interrupt entry forever without the guest ever making progress. So the
 * line is masked on entry and stays masked until the guest clears the
 * APLIC pending bit, which is its way of saying the device has been dealt
 * with -- see irq_unmask_line, reached through the APLIC's eoi hook.
 *
 * Adding a peripheral is one table entry and one handler; the table is the
 * policy, the same way g_periph_map is for addresses.
 */
/*
 * An APLIC source number *is* the NVIC line number, so there is no mapping
 * table -- and, more to the point, none in the guest either. A driver that
 * would call HAL_NVIC_EnableIRQ(TIM6_DAC_IRQn) writes that same 54 to the
 * APLIC's setienum, and the two numbering spaces never have to be
 * reconciled. It is the reason RV_APLIC_SOURCES is 128 rather than 32.
 */
static const IRQn_Type g_bridged[] = {
    TIM6_DAC_IRQn,
};

static bool irq_is_bridged(uint32_t source)
{
    for (unsigned i = 0; i < sizeof(g_bridged) / sizeof(g_bridged[0]); i++) {
        if ((uint32_t)g_bridged[i] == source) {
            return true;
        }
    }
    return false;
}

static void irq_line_entry(IRQn_Type irqn)
{
    NVIC_DisableIRQ(irqn);
    emu_core_set_irq(&g_core, (uint32_t)irqn, true);
}

static void irq_unmask_line(void *ctx, uint32_t source)
{
    (void)ctx;
    if (irq_is_bridged(source)) {
        NVIC_ClearPendingIRQ((IRQn_Type)source);
        NVIC_EnableIRQ((IRQn_Type)source);
    }
}

/*
 * Enable the bridged lines at the NVIC. Priority is left at the default:
 * these handlers do almost nothing, and the emulator has no other interrupt
 * to rank them against.
 */
static void bridged_irqs_init(void)
{
    for (unsigned i = 0; i < sizeof(g_bridged) / sizeof(g_bridged[0]); i++) {
        NVIC_EnableIRQ(g_bridged[i]);
    }
}

void TIM6_DAC_IRQHandler(void)
{
    irq_line_entry(TIM6_DAC_IRQn);
}

/*
 * Where the guest image currently lives. Initialised to the copy
 * guest_image.S baked into the firmware, and repointed at the flash
 * arena when one arrives over TFTP.
 *
 * These exist because build_address_space() used to read the .incbin
 * symbols directly, which made "which image is running" a link-time
 * fact. An upload has to be able to change it at run time.
 */
static const uint8_t *g_img      = rv_guest_image;
static uint32_t       g_img_size;
static uint32_t       g_img_ro;
static bool start_guest(void);

static bool build_address_space(void)
{
    emu_bus_init(&g_bus);

    /*
     * The guest's read-only half is served straight out of the part's
     * flash, where guest_image.S already put it, and RAM starts above
     * it. The guest's own layout does not change at all -- it is still
     * linked contiguously from EMU_GUEST_RAM_BASE and still resets to
     * offset 0 -- only which backing store answers the low addresses.
     *
     * The saving is real: the SRAM buffer now covers guest addresses
     * [ro, ro + GUEST_RAM_SIZE) instead of [0, GUEST_RAM_SIZE), so the
     * guest gains rv_guest_ro_size of address space for nothing. On the
     * largest architecture tests that is 140 KiB of the 345 they need.
     *
     * Both regions are registered even when rv_guest_ro_size is zero or
     * the whole image, because emu_bus rejects a zero-length region and
     * a guest with no .data is the common case here -- two of the three
     * in the tree have one.
     */
    const uint32_t guest_ro = g_img_ro;

    if (guest_ro != 0u &&
        !emu_bus_add_rom(&g_bus, "guest-ro", EMU_GUEST_RAM_BASE,
                         g_img, guest_ro)) {
        return false;
    }
    if (!emu_bus_add_ram(&g_bus, "ram", EMU_GUEST_RAM_BASE + guest_ro,
                        GUEST_RAM_BASE_PTR, GUEST_RAM_SIZE)) {
        return false;
    }

    /*
     * The guest image stays in ARM flash and is exposed read-only, so a
     * guest linked for execute-in-place costs no RAM at all.
     */
    if (!emu_bus_add_rom(&g_bus, "rom", EMU_GUEST_ROM_BASE,
                        g_img, g_img_size)) {
        return false;
    }

    if (!emu_bus_add_mmio(&g_bus, "uart0", EMU_GUEST_UART_BASE,
                         EMU_UART_SIZE, &emu_uart_ops, &g_uart)) {
        return false;
    }

    for (unsigned i = 0; i < sizeof(g_periph_map) / sizeof(g_periph_map[0]); i++) {
        /* Identity map: host base == guest base. */
        if (!emu_bus_add_passthru(&g_bus, g_periph_map[i].name,
                                 g_periph_map[i].base,
                                 g_periph_map[i].size,
                                 (uintptr_t)g_periph_map[i].base,
                                 g_periph_map[i].perm, EMU_WANY)) {
            return false;
        }
    }
    return true;
}

/*
 * Everything that has to be redone when the guest image changes:
 * rebuild the bus from the image's two halves, put the writable half
 * where the guest expects it, and reset the core.
 *
 * Split out of main() because an upload has to repeat it. The address
 * space is torn down and rebuilt rather than patched, because the
 * read-only region's base and length both move when a different image
 * arrives and emu_bus has no way to resize a region in place.
 */
static bool start_guest(void)
{
    const uint32_t rw = g_img_size - g_img_ro;

    if (rw > GUEST_RAM_SIZE) {
        return false;
    }
    if (!build_address_space()) {
        return false;
    }

    /*
     * Only the writable tail. The read-only half is already reachable as
     * a bus region pointing into flash, and copying it would put it in
     * RAM twice -- which is the whole cost the split removes.
     *
     * The rest of guest RAM is cleared. Left alone it would still hold
     * the previous guest's .bss and stack, which is how one architecture
     * test comes to pass on state another test wrote -- the failure mode
     * that makes a suite's results depend on the order it ran in.
     */
    memcpy(GUEST_RAM_BASE_PTR, g_img + g_img_ro, rw);
    memset(GUEST_RAM_BASE_PTR + rw, 0, GUEST_RAM_SIZE - rw);

    emu_core_reset(&g_core, EMU_GUEST_RESET_PC);
    emu_core_boot(&g_core, EMU_GUEST_RAM_BASE, GUEST_RAM_SIZE);
    return true;
}

